src/cf/Catalogs/ПротоколыМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПротоколыМероприятий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Мероприятия</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантИсполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыМаршрутизацииЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантУстановкиСрокаОбработкиРезультатов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУстановкиСрокаИсполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выступили</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнение</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.Исполнение</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияИсполнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоИтераций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контролер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПунктаПрограммы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПунктаПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсполнителей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверяющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решили</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Слушали</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеИсполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПротоколовМероприятий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеИсполненияУстановил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.Исполнение</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияИсполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполненияПроцесса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОбработкиРезультатов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОбработкиРезультатовДни</Name>
					<Comment>Срок обработки результатов автором</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОбработкиРезультатовМинуты</Name>
					<Comment>Срок обработки результатов автором</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОбработкиРезультатовЧасы</Name>
					<Comment>Срок обработки результатов автором</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантУстановкиСрокаИсполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыУстановкиСрокаИсполнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЗадачи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокИсполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокВыполненияЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполненияДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполненияМинуты</Name>
							<Comment>Срок исполнения для исполнителя</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполненияЧасы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияСостоянийПротоколовМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСостоянийПротоколовМероприятий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПротоколовМероприятий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияИсполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПунктПротокола</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПротоколыМероприятий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СостоянияПротоколовМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияПротоколовМероприятий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеТребуетсяИсполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяИсполнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияМероприятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияМероприятий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МатериалыВыступающихЗапрошены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериалыОтправленыНаОзнакомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученыМатериалыВыступающих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияНеПриняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияОтправлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриглашенияПриняты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколГотовиться</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколИсполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНаИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколНеУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколПодготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПротоколУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМатериаламиОзнакомились</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятиеВСтадииПодготовки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятиеОтменено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятиеПроведено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаНаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаНеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаНаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаУтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммаНеУтверждена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПротоколыМероприятий/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет реквизит ПредставлениеИсполнителей.
//
Процедура ОбновитьПредставлениеИсполнителей() Экспорт
	
	МассивПредставлениеИсполнителей = Новый Массив;
	Для Каждого СтрокаИсполнителя Из Исполнители Цикл
		ПредставлениеИсполнителя =
			РаботаСЗадачамиПовтИсп.ПредставлениеУчастника(СтрокаИсполнителя.Исполнитель);
		МассивПредставлениеИсполнителей.Добавить(ПредставлениеИсполнителя);
	КонецЦикла;
	
	НовоеПредставлениеИсполнителей = СтрСоединить(МассивПредставлениеИсполнителей, ", ");
	
	НовоеПредставлениеИсполнителей =
		РаботаСоСтроками.Сократить(НовоеПредставлениеИсполнителей, 1024);
	Если НовоеПредставлениеИсполнителей = ПредставлениеИсполнителей Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеИсполнителей = НовоеПредставлениеИсполнителей;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СостояниеИсполнения = Перечисления.СостоянияПротоколовМероприятий.ТребуетсяИсполнение;
	СостояниеИсполненияУстановил = Сотрудники.ОсновнойСотрудник();
	
	Если Не ЗначениеЗаполнено(Проверяющий) Тогда
		Проверяющий = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Контролер) Тогда
		Контролер = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверим уникальность номера протокола, для удобства ввода.
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПротоколыМероприятий.Ссылка
		|ИЗ
		|	Справочник.ПротоколыМероприятий КАК ПротоколыМероприятий
		|ГДЕ
		|	ПротоколыМероприятий.Владелец = &Владелец
		|	И ПротоколыМероприятий.НомерПунктаПротокола = &НомерПунктаПротокола
		|	И ПротоколыМероприятий.Ссылка <> &Ссылка
		|	И Не ПротоколыМероприятий.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("НомерПунктаПротокола", НомерПунктаПротокола);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	НомерУникален = РезультатЗапроса.Пустой();
	
	Если Не НомерУникален Тогда
		ТекстОшибки = НСтр("ru = 'Номер не уникален.'");
		ОбщегоНазначения.СообщитьПользователю(
			ТекстОшибки, ЭтотОбъект, "НомерПунктаПротокола", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.ЗагрузкаОбработанныхДанныхИзДругойСистемы Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = Решили;
	СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СостояниеИсполнения, НомерПунктаПрограммы");
	ДополнительныеСвойства.Вставить("СтарыеРеквизиты", СтарыеРеквизиты);
	
	ОбновитьПредставлениеИсполнителей();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСеанса.ЗагрузкаОбработанныхДанныхИзДругойСистемы Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.СтарыеРеквизиты.НомерПунктаПрограммы <> НомерПунктаПрограммы Тогда
		ПриИзмененииНомераПунктаПрограммы();
	КонецЕсли;
	
	Если ДополнительныеСвойства.СтарыеРеквизиты.СостояниеИсполнения <> СостояниеИсполнения Тогда
		ПриИзмененииСостоянияИсполнения();
	КонецЕсли;
	
	ПроверитьИзменениеСостоянияМероприятия();
	
	// Рабочая группа мероприятия.
	Если Не ДополнительныеСвойства.Свойство("ПропуститьРасширениеРабочейГруппыМероприятия")
		Или Не ДополнительныеСвойства.ПропуститьРасширениеРабочейГруппыМероприятия Тогда
		ТаблицаНабора = РаботаСРабочимиГруппами.ПолучитьРабочуюГруппуДокумента(Владелец);
		КолСтрокДоДобавления = ТаблицаНабора.Количество();
		РаботаСРабочимиГруппами.ДобавитьУчастникаВТаблицуНабора(ТаблицаНабора, Контролер, Ложь);
		РаботаСРабочимиГруппами.ДобавитьУчастникаВТаблицуНабора(ТаблицаНабора, Ответственный, Ложь);
		РаботаСРабочимиГруппами.ДобавитьУчастникаВТаблицуНабора(ТаблицаНабора, Проверяющий, Ложь);
		Если ТаблицаНабора.Количество() > КолСтрокДоДобавления Тогда
			РаботаСРабочимиГруппами.ПерезаписатьРабочуюГруппуОбъекта(Владелец, ТаблицаНабора, Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СостояниеИсполнения = Перечисления.СостоянияПротоколовМероприятий.ТребуетсяИсполнение;
	СостояниеИсполненияУстановил = 
		Сотрудники.ОсновнойСотрудник();
	Исполнение = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Корректирует протокол мероприятия при изменении номер пункта программы.
//
Процедура ПриИзмененииНомераПунктаПрограммы()
	
	// Помеченные на удаление пункты протокола не отражаем в протоколе мероприятия.
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Мероприятие = Владелец.ПолучитьОбъект();
	Мероприятие.Заблокировать();
	
	// Находим строку в протоколе мероприятия. Если ее нет - добавляем.
	СтрокаЭтогоПунктаПротокола = Мероприятие.Протокол.Найти(Ссылка, "ПунктПротокола");
	Если СтрокаЭтогоПунктаПротокола = Неопределено Тогда
		
		ОписаниеЧисла = Новый ОписаниеТипов("Число");
		
		РазделенныйНомерПункта = СтрРазделить(НомерПунктаПротокола, ".");
		Если РазделенныйНомерПункта.Количество() >= 1 Тогда
			АвтоНомерПункта = ОписаниеЧисла.ПривестиЗначение(РазделенныйНомерПункта[0]);
		Иначе
			АвтоНомерПункта = 0;
		КонецЕсли;
		Если РазделенныйНомерПункта.Количество() >= 2 Тогда
			АвтоНомерПодпункта = ОписаниеЧисла.ПривестиЗначение(РазделенныйНомерПункта[1]);
		Иначе
			АвтоНомерПодпункта = 0;
		КонецЕсли;
		
		Если АвтоНомерПункта = 0 Тогда
			
			ИндексВставки = Мероприятие.Протокол.Количество();
			
		Иначе
			
			ПунктыПротокола = Мероприятие.Протокол.ВыгрузитьКолонку("ПунктПротокола");
			РеквизитыПунктовПротокола =
				ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
					ПунктыПротокола,
					"НомерПунктаПротокола");
			
			ИндексВставки = 0;
			Для Каждого СтрокаПротокола Из Мероприятие.Протокол Цикл
				
				РеквизитыПунктаПротокола =
					РеквизитыПунктовПротокола[СтрокаПротокола.ПунктПротокола];
				
				РазделенныйНомерПункта =
					СтрРазделить(РеквизитыПунктаПротокола.НомерПунктаПротокола, ".");
				Если РазделенныйНомерПункта.Количество() >= 1 Тогда
					НомерПунктаСтроки = ОписаниеЧисла.ПривестиЗначение(РазделенныйНомерПункта[0]);
				Иначе
					НомерПунктаСтроки = 0;
				КонецЕсли;
				Если РазделенныйНомерПункта.Количество() >= 2 Тогда
					НомерПодпунктаСтроки =
						ОписаниеЧисла.ПривестиЗначение(РазделенныйНомерПункта[1]);
				Иначе
					НомерПодпунктаСтроки = 0;
				КонецЕсли;
				
				Если НомерПунктаСтроки = 0 Тогда
					ИндексВставки = Мероприятие.Протокол.Количество();
					Прервать;
				КонецЕсли;
				
				Если АвтоНомерПункта > НомерПунктаСтроки Тогда
					
					// Наш пункт ещё впереди.
					ИндексВставки = ИндексВставки + 1;
					Продолжить;
					
				ИначеЕсли АвтоНомерПункта = НомерПунктаСтроки
					И АвтоНомерПодпункта >= НомерПодпунктаСтроки Тогда
					
					// Это наш пункт, наш подпункт ещё впередит.
					ИндексВставки = ИндексВставки + 1;
					Продолжить;
					
				Иначе
					
					// Наш пункт уже прошёл.
					Прервать;
					
				КонецЕсли;
				
				ИндексВставки = ИндексВставки + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
		СтрокаЭтогоПунктаПротокола = Мероприятие.Протокол.Вставить(ИндексВставки);
		
		
	КонецЕсли;
	СтрокаЭтогоПунктаПротокола.НомерПунктаПрограммы = НомерПунктаПрограммы;
	СтрокаЭтогоПунктаПротокола.ПунктПротокола = Ссылка;
	
	Мероприятие.Записать();
	
КонецПроцедуры

// Отмечает изменение состояния пункта протокола в истории.
//
Процедура ПриИзмененииСостоянияИсполнения()
	
	РегистрыСведений.ИсторияСостоянийПротоколовМероприятий.ДобавитьЗапись(
		ТекущаяДата(),
		Ссылка,
		СостояниеИсполнения,
		СостояниеИсполненияУстановил,
		Владелец);
	
КонецПроцедуры

// Проверяет изменение состояние мероприятия.
//
Процедура ПроверитьИзменениеСостоянияМероприятия()
	
	Если ДополнительныеСвойства.СтарыеРеквизиты.СостояниеИсполнения = СостояниеИсполнения Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СостояниеИсполненияУстановил) <> Тип("БизнесПроцессСсылка.Исполнение") Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеМероприятия = РассчитатьСостояниеИсполненияПротоколаМероприятия(Владелец);
	Если СостояниеМероприятия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтароеСостояниеМероприятия = УправлениеМероприятиями.ПолучитьСостояниеМероприятия(Владелец, "СостояниеПротокола");
	Если СтароеСостояниеМероприятия <> СостояниеМероприятия Тогда
		УправлениеМероприятиями.ЗаписатьСостояниеМероприятия(Владелец, ТекущаяДата(), СостояниеМероприятия, СостояниеИсполненияУстановил);
	КонецЕсли;
	
КонецПроцедуры

// Рассчитывает состояние исполнения протокола мероприятия по состоянию пунктов протокола.
//
// Параметры:
//  Мероприятие - СправочникСсылка.Мероприятия - Мероприятие.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СостоянияМероприятий - Рассчитанное состояние исполнения протокола.
//
Функция РассчитатьСостояниеИсполненияПротоколаМероприятия(Мероприятие)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПротоколыМероприятий.СостояниеИсполнения
		|ИЗ
		|	Справочник.Мероприятия.Протокол КАК МероприятияПротокол
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПротоколыМероприятий КАК ПротоколыМероприятий
		|		ПО МероприятияПротокол.ПунктПротокола = ПротоколыМероприятий.Ссылка
		|ГДЕ
		|	ПротоколыМероприятий.ПометкаУдаления = ЛОЖЬ
		|	И МероприятияПротокол.Ссылка = &Мероприятие";
	
	Запрос.УстановитьПараметр("Мероприятие", Мероприятие);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ЕстьИсполнен = Ложь;
	ЕстьНаИсполнении = Ложь;
	ЕстьТребуетсяИсполнение = Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.СостояниеИсполнения = Перечисления.СостоянияПротоколовМероприятий.Исполнен Тогда
			ЕстьИсполнен = Истина;
		ИначеЕсли Выборка.СостояниеИсполнения = Перечисления.СостоянияПротоколовМероприятий.НаИсполнении Тогда
			ЕстьНаИсполнении = Истина;
		ИначеЕсли Выборка.СостояниеИсполнения = Перечисления.СостоянияПротоколовМероприятий.ТребуетсяИсполнение Тогда
			ЕстьТребуетсяИсполнение = Истина;
		КонецЕсли;
	КонецЦикла;
	
	СостояниеИсполненияПротоколаМероприятия = Неопределено;
	Если ЕстьИсполнен И Не ЕстьНаИсполнении И Не ЕстьТребуетсяИсполнение Тогда
		СостояниеИсполненияПротоколаМероприятия = Перечисления.СостоянияМероприятий.ПротоколИсполнен;
	ИначеЕсли ЕстьНаИсполнении Тогда
		СостояниеИсполненияПротоколаМероприятия = Перечисления.СостоянияМероприятий.ПротоколНаИсполнении;
	ИначеЕсли ЕстьИсполнен И ЕстьТребуетсяИсполнение Тогда
		СостояниеИсполненияПротоколаМероприятия = Перечисления.СостоянияМероприятий.ПротоколНаИсполнении;
	КонецЕсли;
	
	Возврат СостояниеИсполненияПротоколаМероприятия;
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
